tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'pivotal/tap'

# Mac App Store
brew 'mas'

# GNU
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'autossh'
brew 'coreutils'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'md5sha1sum'
brew 'openssl'
brew 'wget'

# Shell / System
brew 'bash-completion'
brew 'htop'
brew 'p7zip'
brew 'pass'
brew 'pstree'
brew 'runit'
brew 'tmux'
brew 'tree'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'

# Network
brew 'arp-scan'
brew 'cntlm'
brew 'mtr'
brew 'wrk'

# General Dev Tools
brew 'sshfs'
brew 'asciinema'
brew 'cloc'
brew 'docker'
brew 'httpie'
brew 'jq'
brew 'ldapvi'
brew 'nginx'
brew 'packer'
brew 'sqlite'
brew 'ssh-copy-id'

# AWS
brew 'awscli'
brew 'awsebcli'
brew 'ec2-api-tools'

# Config Management
brew 'ansible'

# Clojure
brew 'leiningen'

# Database
brew 'pgcli'

# Git
cask 'gitup'
cask 'sourcetree'

# Go
brew 'go'

# Haskell
brew 'ghc'
brew 'cabal-install'

# Heroku
brew 'heroku'

# Java
brew 'gdub'
brew 'gradle'
cask 'java'
brew 'springboot'

# Apache
brew 'apache-drill'
brew 'kafkacat'

# Kubernetes
cask 'minikube'
brew 'docker-machine-driver-xhyve'
brew 'kubernetes-cli'
# docker-machine-driver-xhyve needs root owner and uid
# sudo chown root:wheel $(brew --prefix)/opt/docker-machine-driver-xhyve/bin/docker-machine-driver-xhyve
# sudo chmod u+s $(brew --prefix)/opt/docker-machine-driver-xhyve/bin/docker-machine-driver-xhyve

# NodeJS
brew 'nodejs'

# Python
brew 'jython'
brew 'python'
brew 'python3'

# Ruby
brew 'rbenv'

# Scala
brew 'sbt'

# Mac App dependencies
cask 'xquartz' #required by inkscape

# Mac Apps
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'dbeaver-community'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'freeplane'
cask 'gimp'
cask 'google-chrome'
cask 'inkscape'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'vlc'

# Photos / Images
brew 'autotrace'
brew 'exiftool'
brew 'imagemagick'

# PDF
brew 'qpdf'

# Software Design
brew 'plantuml'
brew 'sdedit'

# Random
brew 'aview'
brew 'cowthink'
brew 'cowsay'
brew 'figlet'
