tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'AdoptOpenJDK/openjdk'
tap 'aws/tap'
tap 'gdubw/gng'

# Mac App Store
brew 'mas'

# GNU
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'autossh'
brew 'coreutils'
brew 'curl-openssl'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gpg'
brew 'grep'
brew 'moreutils'
brew 'openssl'
brew 'wget'

# Shell / System
brew 'bash-completion'
brew 'bats'
brew 'htop'
brew 'p7zip'
brew 'pass'
brew 'pstree'
brew 'runit'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'

# Network
brew 'arp-scan'
brew 'cntlm'
# start up by running `sudo brew services start dnsmasq`
brew 'dnsmasq'
brew 'ipcalc'
brew 'magic-wormhole'
brew 'mtr'
brew 'nghttp2'
brew 'nmap'
brew 'socat'
brew 'sslyze'
brew 'wrk'

# General Dev Tools
brew 'asciinema'
brew 'cloc'
brew 'httpie'
brew 'jq'
brew 'ldapvi'
brew 'nginx'
brew 'packer'
brew 'rats'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'sysdig'
brew 'the_silver_searcher'

# AWS
cask 'aws-sam-cli'
brew 'awscli'
brew 'awsebcli'
brew 'cfn-lint'
brew 'cli53'
brew 'ec2-api-tools'
cask 'session-manager-plugin'


# CI/CD

# Config Management
brew 'ansible'

# Clojure
brew 'leiningen'

# Database
brew 'pgbadger'
brew 'pgcli'

# Git
brew 'git-extras'
brew 'git-gui'
cask 'sourcetree'

# Go
brew 'dep'
brew 'go'

# Google
cask 'google-cloud-sdk'

# Haskell
brew 'ghc'
brew 'cabal-install'

# Java
cask 'adoptopenjdk8'
cask 'adoptopenjdk8-openj9'
brew 'gng'
brew 'springboot'

# Apache
brew 'apache-drill'
brew 'kafkacat'

# Kubernetes
brew 'kubernetes-cli'
brew 'kubectx'

# Javascript
brew 'nodejs'
brew 'yarn'

# Python
brew 'python'
brew 'python3'

# Ruby
brew 'rbenv'

# Scala
brew 'sbt'

# Mac Apps
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'dbeaver-community'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'freeplane'
cask 'gimp'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'vlc'

# Fonts
cask 'font-consolas-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-meslo-for-powerline'
cask 'font-source-code-pro'

# Photos / Images
brew 'exiftool'
brew 'imagemagick'

# PDF
brew 'qpdf'

# Software Design
brew 'plantuml'
brew 'sdedit'

# Random
brew 'aview'
brew 'cowthink'
brew 'cowsay'
brew 'figlet'
